// 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
// 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1

// Შექმენით მასივი რომელშიც ჩაწერთ 
// ყველა 3 ის ჯერად რიცხვს 0 დან 100-მდე.

// var list = [];

// for(var i=1; i<100; i++){
//     if(i%3==0){
//         list.push(i);
//     }
// }
// console.log(list);


// 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2
// 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2

// Შექმენით მასივი რომელშიც ჩაწერთ თქვენი 
// მეგობრების სახელებს და
// დაბეჭდეთ console-ში ყველა ის სახელი 
// რომელიც იწყება სიმბოლო a- ზე.

// var nameList = ["andro","nika", "aleqsi", "mari", "ana", "dato", "avto", "saba", "ani", "ruska", "sofo", "salo", "ana"];

// for(var i=0; i<nameList.length; i++){
//     if(nameList[i][0]=='a'){
//         console.log(nameList[i]);
//     }
// }


// 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3
// 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3

// Შექმენით მასივი რომელშიც შეინახავთ ყველა 0-დან --- 50-მდე ყველა 2 ის ჯერად
// ან 5 ის ჯერად რიცხვებს მაგრამ არავითარ შემთხვევაში ერთდროულად 2-ის და 5 -
// ის ჯერად რიცხვებს.

// var list = [];

// for(var i=1; i<50; i++){
//     if(i%10!=0){
//         if(i%2==0 || i%5==0)
//         list.push(i);
//     }
// }
// console.log(list);


// Შექმენით მასივი რომელშიც იქნება შენახული რიცხვები 2, 121, 4341, 242, 562,
// 43, 182, 55, 32, 98, 326 , გადაიარეთ მასივზე ციკლის მეშვეობით და დაბეჭდეთ
// კონსოლ ული რიცხვის გამოყოფების რაოდენობა.

// var list = [121, 4341, 242, 562, 43, 182, 55, 32, 98, 326];
// var list2 = [];
// var countList = [];
// var count= 0;

// for(var i = 0; i<list.length; i++){
//     for(var j=0; j<=list[i]; j++){
//         if(list[i]%j==0){
//             count++;
//             list2.push(j);
//         }
//     }
//     countList.push(count);
//     count = 0;
// }

// console.log(list2);
// console.log(countList);